In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from numpy.random import randn

In [7]:
x=np.random.seed(101)
x

In [8]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [9]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [11]:
type(df['W'])

pandas.core.series.Series

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
type(df[['W','X']])

pandas.core.frame.DataFrame

In [15]:
df['new']=df['W']+df['Y']

In [16]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df.drop('E',axis=0 )

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [19]:
df.shape

(5, 4)

In [20]:
df.loc['B','Z']

0.6059653494949336

In [21]:
df.iloc[2,:3]

W   -2.018168
X    0.740122
Y    0.528813
Name: C, dtype: float64

In [22]:
df[:'Y']

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
#conditional Selection

In [24]:
b=df>0

In [25]:
df[b]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [28]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [31]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [32]:
bolscer=df['W']>0
res=df[bolscer]

In [33]:
res[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [34]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [35]:
#about index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
newind='cA Ny Wy OR CO'.split()

In [37]:
newind

['cA', 'Ny', 'Wy', 'OR', 'CO']

In [38]:
df['state']=newind

In [39]:
df

          W         X         Y         Z state
A  2.706850  0.628133  0.907969  0.503826    cA
B  0.651118 -0.319318 -0.848077  0.605965    Ny
C -2.018168  0.740122  0.528813 -0.589001    Wy
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [40]:
df.set_index('state',inplace=True)

In [41]:
df

              W         X         Y         Z
state
cA     2.706850  0.628133  0.907969  0.503826
Ny     0.651118 -0.319318 -0.848077  0.605965
Wy    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [42]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [43]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [44]:
inside

[1, 2, 3, 1, 2, 3]

In [45]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [46]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [47]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [48]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [49]:
df.index.names=['groups','Num']

In [50]:
df

                   A         B
groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [51]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [52]:
df

                   A         B
groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [53]:
 df.xs('G1') #ability to skip and go inside multilevel indec

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [54]:
df.xs(1,level='Num')

               A         B
groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [55]:
#missing data
import numpy

In [56]:
d={'A':[1,2,np.nan],'b':[5,np.nan,np.nan],'C':[1,2,3]}

In [57]:
df=pd.DataFrame(d)

In [58]:
df

     A    b  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [59]:
df.dropna()

     A    b  C
0  1.0  5.0  1

In [60]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [61]:
df.dropna(thresh=2)

     A    b  C
0  1.0  5.0  1
1  2.0  NaN  2

In [62]:
df[['A','C']].fillna(value=df[['A','C']].mean())

     A  C
0  1.0  1
1  2.0  2
2  1.5  3

In [63]:
#Group BY method using pandas

In [64]:
data={'company':['GooG','GooG','MSFT ','MSFT' ,'FB' ,'FB'],
     'person':['Sam','Charle','AMy','VArnessa','carl','sarah'],
     'sales':[200,120,300,124,243,350]}

In [65]:
data

{'company': ['GooG', 'GooG', 'MSFT ', 'MSFT', 'FB', 'FB'],
 'person': ['Sam', 'Charle', 'AMy', 'VArnessa', 'carl', 'sarah'],
 'sales': [200, 120, 300, 124, 243, 350]}

In [66]:
df=pd.DataFrame(data)

In [67]:
df

  company    person  sales
0    GooG       Sam    200
1    GooG    Charle    120
2   MSFT        AMy    300
3    MSFT  VArnessa    124
4      FB      carl    243
5      FB     sarah    350

In [68]:
bycom=df.groupby('company')

In [69]:
bycom.mean()

         sales
company
FB       296.5
GooG     160.0
MSFT     124.0
MSFT     300.0

In [70]:
bycom.std()

             sales
company
FB       75.660426
GooG     56.568542
MSFT           NaN
MSFT           NaN

In [186]:
bycom.sum()

         sales
company
FB         593
GooG       320
MSFT       124
MSFT       300

In [188]:
bycom.sum().loc['FB']

sales    593
Name: FB, dtype: int64

In [189]:
df.groupby('company').max()

           person  sales
company
FB          sarah    350
GooG          Sam    200
MSFT     VArnessa    124
MSFT          AMy    300

In [190]:
df.groupby('company').min()

           person  sales
company
FB           carl    243
GooG       Charle    120
MSFT     VArnessa    124
MSFT          AMy    300

In [195]:
df.groupby('company').describe().transpose()['FB']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [196]:
#merging joining

In [205]:
df1=pd.DataFrame({"A":['A0','A1','A2','A3'],
                 'B':['B0', 'B1' ,'B2' ,'B3'],
                 'C':['C0' ,'C1' ,'C2 ','C3'],
                 'D':['D0','D1','D2' ,'D3']})

In [206]:
df2=pd.DataFrame({"A":['A4','A5','A6','A7'],
                 'B':['B4', 'B5' ,'B6' ,'B7'],
                 'C':['C4' ,'C5' ,'C6 ','C37'],
                 'D':['D4','D5','D6' ,'D7']})

In [207]:
df3=pd.DataFrame({"A":['A8','A9','A10','A11'],
                 'B':['B8', 'B9' ,'B10' ,'B11'],
                 'C':['C8' ,'C9' ,'C10 ','C11'],
                 'D':['D8','D9','D10' ,'D11']})

In [208]:
df1

    A   B    C   D
0  A0  B0   C0  D0
1  A1  B1   C1  D1
2  A2  B2  C2   D2
3  A3  B3   C3  D3

In [209]:
df2

    A   B    C   D
0  A4  B4   C4  D4
1  A5  B5   C5  D5
2  A6  B6  C6   D6
3  A7  B7  C37  D7

In [210]:
df3

     A    B     C    D
0   A8   B8    C8   D8
1   A9   B9    C9   D9
2  A10  B10  C10   D10
3  A11  B11   C11  D11

In [216]:
d=pd.concat([df1,df2,df3],axis=0) #pass list df of same size axis=1/0

In [217]:
d

     A    B     C    D
0   A0   B0    C0   D0
1   A1   B1    C1   D1
2   A2   B2   C2    D2
3   A3   B3    C3   D3
0   A4   B4    C4   D4
1   A5   B5    C5   D5
2   A6   B6   C6    D6
3   A7   B7   C37   D7
0   A8   B8    C8   D8
1   A9   B9    C9   D9
2  A10  B10  C10   D10
3  A11  B11   C11  D11

In [82]:
left=pd.DataFrame({'key':['k0' ,'k1' ,'k2', 'k3'],
                  "A":['A0','A1','A2','A3'],
                 'B':['B0', 'B1' ,'B2' ,'B3']
                 })

In [83]:
right=pd.DataFrame({'key':['k0' ,'k1' ,'k2', 'k3'],
                  "C":['C0','C1','C2','C3'],
                 'D':['D0', 'D1' ,'D2' ,'D3']
                 })

In [84]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [85]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

In [86]:
left=pd.DataFrame({'key1':['k0' ,'k1' ,'k2', 'k3'],
                   'Key2':['K0', 'K1','K0 ','K1'],
                  "A":['A0','A1','A2','A3'],
                 'B':['B0', 'B1' ,'B2' ,'B3']
                 })

In [87]:
right=pd.DataFrame({'key1':['k0' ,'k1' ,'k2', 'k3'],
                   'Key2':['K0', 'K0','K0 ','K0'],
                  "A":['A0','A1','A2','A3'],
                 'B':['B0', 'B1' ,'B2' ,'B3']
                 })

In [88]:
pd.merge(left,right,how='inner',on=['key1','Key2'])

  key1 Key2 A_x B_x A_y B_y
0   k0   K0  A0  B0  A0  B0
1   k2  K0   A2  B2  A2  B2

In [89]:
left=pd.DataFrame({
                  "A":['A0','A1','A2','A3'],
                 'B':['B0', 'B1' ,'B2' ,'B3']
                 },index=['k0' ,'k1' ,'k2', 'k3'])

In [90]:
right=pd.DataFrame({ "C":['C0','C1','C2','C3'],
                 'D':['D0', 'D1' ,'D2' ,'D3']
                 },index=['k0' ,'k1' ,'k2', 'k3'])

In [91]:
left.join(right,how='outer')

     A   B   C   D
k0  A0  B0  C0  D0
k1  A1  B1  C1  D1
k2  A2  B2  C2  D2
k3  A3  B3  C3  D3

In [92]:
df=pd.DataFrame({'col1':[1,2,3,4],
             'col2':[444,555,666,444],
             'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [93]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [94]:
df['col2'].nunique()

3

In [95]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [96]:
df[(df['col1']>2) & (df['col2']>2)]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [97]:
def  time2(x):
    return x*2

In [98]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [99]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [100]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [101]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [102]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [103]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [104]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [105]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [106]:
df.pivot_table

<bound method DataFrame.pivot_table of    col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz>